# -*- coding: utf-8 -*-
import pandas as pd

#--------------------------------------------------------
#Function Name : Chip_OneDay_Sort
#Description   : 整理單日數據
#Input         : data frame, str
#Output        : data frame
#--------------------------------------------------------

def Chip_OneDay_Sort( input_df, date ):

    #--------------------------------------------------------
    #新增欄位-買進價格*股數
    #新增欄位-賣出價格*股數
    #--------------------------------------------------------

    input_df[ '買進價格*股數' ] = input_df[ '買進股數' ] * input_df[ '價格' ]
    input_df[ '賣出價格*股數' ] = input_df[ '賣出股數' ] * input_df[ '價格' ]
    #--------------------------------------------------------

    # --------------------------------------------------------
    # 依據券商群組分類
    # --------------------------------------------------------

    input_df = input_df.groupby( '券商' ).sum( )
    # --------------------------------------------------------

    # --------------------------------------------------------
    # 新增欄位-買賣超
    # 新增欄位-買進均價
    # 新增欄位-賣出均價
    # --------------------------------------------------------

    df[ '買賣超' ] = df[ '買進股數' ] - df[ '賣出股數' ]
    df[ '買進均價' ] = df[ '買進價格*股數' ] / df[ '買進股數' ]
    df[ '賣出均價' ] = df[ '賣出價格*股數' ] / df[ '賣出股數' ]
    # --------------------------------------------------------

    # -------------------------------------------------------
    # 刪除序號欄位，axis = 1 代表x軸
    # 刪除價格欄位，axis = 1 代表x軸
    # -------------------------------------------------------

    input_df.drop( '價格', axis=1, level=None, inplace=True )
    input_df.drop( '序號', axis=1, level=None, inplace=True )
    # -------------------------------------------------------

    return input_df

#--------------------------------------------------------
#Function Name : Chip_OneDay_Sort
#Description   : 刪除欄位-序號，新增欄位-日期
#Input         : data frame, str
#Output        : data frame
#--------------------------------------------------------

def Chip_AddDate( input_df, date ):

    # -------------------------------------------------------
    # 刪除序號欄位，axis = 1 代表x軸
    # 刪除價格欄位，axis = 1 代表x軸
    # -------------------------------------------------------

    del input_df[ '價格' ]
    # del input_df[ '序號' ]
    # input_df.drop( '?序號', axis=1, level=None, inplace=True )
    # input_df.drop( '價格', axis=1, level=None, inplace=True )
    # -------------------------------------------------------

    # --------------------------------------------------------
    # 新增欄位-日期
    # --------------------------------------------------------
    input_df['日期'] = date

    return input_df

#-------------------------------------------------------
#近三日買賣超張數
#近五日買賣超張數
#近十日買賣超張數
#-------------------------------------------------------

#-------------------------------------------------------
#近三日買賣超金額
#近五日買賣超金額
#近十日買賣超金額
#-------------------------------------------------------

year_str = [ '20161118', '20161121', '20161122', '20161123', '20161124' ]
target_str = '券商分點-2330台積電_再次整理'
Combin_Df = pd.DataFrame( )


def foo( in_df ):
    # -------------------------------------------------------
    # 近三日買進均價
    # 近五日買進均價
    # -------------------------------------------------------

    in_df[ '近3日買進均價' ] = in_df[ '買進價格*股數' ].head( 3 ).sum( ) / in_df[ '買進股數' ].head( 3 ).sum( )
    in_df[ '近5日買進均價' ] = in_df[ '買進價格*股數' ].head( 5 ).sum( ) / in_df[ '買進股數' ].head( 5 ).sum( )

    # -------------------------------------------------------
    # 近三日賣出均價
    # 近五日賣出均價
    # -------------------------------------------------------

    in_df[ '近3日賣出均價' ] = in_df[ '賣出價格*股數' ].head( 3 ).sum( ) / in_df[ '賣出股數' ].head( 3 ).sum( )
    in_df[ '近5日賣出均價' ] = in_df[ '賣出價格*股數' ].head( 5 ).sum( ) / in_df[ '賣出股數' ].head( 5 ).sum( )

    # -------------------------------------------------------
    # 近三日買賣超
    # 近五日買賣超
    # -------------------------------------------------------

    in_df[ '近3日買賣超' ] = in_df[ '買賣超' ].head( 3 ).sum( )
    in_df[ '近5日買賣超' ] = in_df[ '買賣超' ].head( 5 ).sum( )

    # -------------------------------------------------------
    # 近三日買賣超金額
    # 近五日買賣超金額
    # -------------------------------------------------------

    in_df[ '近3日買賣超金額' ] = in_df[ '買進價格*股數' ].head( 3 ).sum( ) - in_df[ '賣出價格*股數' ].head( 3 ).sum( )
    in_df[ '近5日買賣超金額' ] = in_df[ '買進價格*股數' ].head( 5 ).sum( ) - in_df[ '賣出價格*股數' ].head( 5 ).sum( )

    return in_df

for year_value_str in year_str:

    print( year_value_str )

    # --------------------------------------------------------
    # 讀取CSV File至DataFrame
    # --------------------------------------------------------

    filename_str = './/卷商分點-2330台積電_' + year_value_str + '.csv'
    df = pd.read_csv( filename_str, sep = ',', encoding  = 'utf-8' )
    #---------------------------------------------------------

    target = Chip_AddDate( df, year_value_str )
    target.to_csv( target_str + '_' + year_value_str + '.csv', sep=',', line_terminator='\n' )

    Combin_Df = pd.concat( [ target, Combin_Df ] )


# --------------------------------------------------------
# 刪除欄位-序號
# --------------------------------------------------------

# def Combin_DF['序號']
# --------------------------------------------------------

Combin_Df.sort_values( ['券商', '日期'], inplace=True )

Combin_Df[ '日期' ] = pd.to_datetime( Combin_Df[ '日期' ], format='%Y%m%d')

grouped = Combin_Df.groupby( '券商', sort = False )
Combin_Df = grouped.apply( foo )
Combin_Df.to_csv( '台積電籌碼整理_進階.csv', sep=',', line_terminator='\n' )


